{
  "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies/$entity",
  "id": "70a26b45-5aa3-4b22-82b2-c39948399ce9",
  "createdDateTime": "2024-08-16T22:12:53.3220744Z",
  "displayName": "CA090: Prevent AitM for Compliant and Hybrid Join Devices",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [ "all" ],
    "servicePrincipalRiskLevels": [ ],
    "signInRiskLevels": [ ],
    "userRiskLevels": [ ],
    "applications": {
      "excludeApplications": [ ],
      "includeApplications": [ "All" ],
      "includeAuthenticationContextClassReferences": [ ],
      "includeUserActions": [ ]
    },
    "devices": {
      "deviceFilter": {
        "mode": "include",
        "rule": "device.isCompliant -eq True -or device.trustType -eq \"ServerAD\""
      }
    },
    "users": {
      "excludeGroups": [ ],
      "excludeRoles": [ ],
      "excludeUsers": [ ],
      "includeGroups": [ ],
      "includeRoles": [ ],
      "includeUsers": [ "All" ]
    }
  },
  "grantControls": {
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies(\u002770a26b45-5aa3-4b22-82b2-c39948399ce9\u0027)/grantControls/authenticationStrength/$entity",
    "builtInControls": [ "compliantDevice", "domainJoinedDevice" ],
    "customAuthenticationFactors": [ ],
    "operator": "OR",
    "termsOfUse": [ ]
  }
}
