{
  "templateId": null,
  "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies/$entity",
  "grantControls": {
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('1782fb6f-864f-487c-82d8-ee5ff1cae311')/grantControls/authenticationStrength/$entity",
    "customAuthenticationFactors": [],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "AND",
    "builtInControls": [
      "mfa",
      "passwordChange"
    ]
  },
  "displayName": "User-UserRisk-High-PasswordReset",
  "conditions": {
    "authenticationFlows": null,
    "userRiskLevels": [
      "high"
    ],
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": [],
    "platforms": null,
    "clientApplications": null,
    "users": {
      "excludeGroups": [],
      "excludeGuestsOrExternalUsers": null,
      "includeUsers": [
        "All"
      ],
      "includeGuestsOrExternalUsers": null,
      "includeGroups": [],
      "excludeUsers": [],
      "includeRoles": [],
      "excludeRoles": []
    },
    "devices": null,
    "clientAppTypes": [
      "all"
    ],
    "locations": null,
    "insiderRiskLevels": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "applicationFilter": null,
      "includeAuthenticationContextClassReferences": []
    }
  },
  "state": "enabledForReportingButNotEnforced",
  "sessionControls": {
    "applicationEnforcedRestrictions": null,
    "signInFrequency": {
      "value": null,
      "isEnabled": true,
      "authenticationType": "primaryAndSecondaryAuthentication",
      "frequencyInterval": "everyTime",
      "type": null
    },
    "persistentBrowser": null,
    "secureSignInSession": null,
    "cloudAppSecurity": null,
    "disableResilienceDefaults": null
  }
}