{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-03-21T05:41:04.2709126Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-09-16T06:58:05.2460344Z",
    "name": "Global Secure Access - Extensions",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies": "mdm,appleRemoteManagement",
    "id": "a5d62c8d-3dec-49e5-bfbf-3d975252243a",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.system-extension-policy_com.apple.system-extension-policy",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                "settingDefinitionId": "com.apple.system-extension-policy_allowedsystemextensions",
                                "settingInstanceTemplateReference": null,
                                "groupSettingCollectionValue": [
                                    {
                                        "settingValueTemplateReference": null,
                                        "children": [
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                                "settingDefinitionId": "com.apple.system-extension-policy_allowedsystemextensions_generickey",
                                                "settingInstanceTemplateReference": null,
                                                "simpleSettingCollectionValue": [
                                                    {
                                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                        "settingValueTemplateReference": null,
                                                        "value": "com.microsoft.globalsecureaccess.tunnel"
                                                    },
                                                    {
                                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                        "settingValueTemplateReference": null,
                                                        "value": "com.microsoft.globalsecureaccess"
                                                    }
                                                ]
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                "settingDefinitionId": "com.apple.system-extension-policy_allowedsystemextensions_generickey_keytobereplaced",
                                                "settingInstanceTemplateReference": null,
                                                "simpleSettingValue": {
                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                    "settingValueTemplateReference": null,
                                                    "value": "UBF8T346G9"
                                                }
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        }
    ]
}